{
    "products": [
      {
        "name": "Sony Noise Cancelling Headphones",
        "image": "https://example.com/images/sony_headphones.jpg",
        "description": "These Sony headphones feature industry-leading noise cancellation technology, delivering a truly immersive listening experience. The headphones are wireless, with up to 30 hours of battery life, and feature touch controls for easy operation."
      },
      {
        "name": "Apple iPhone 13",
        "image": "https://example.com/images/iphone_13.jpg",
        "description": "The iPhone 13 features a stunning Super Retina XDR display, A15 Bionic chip, and 5G connectivity. The dual-camera system takes stunning photos and videos, and the device is available in a range of colors and storage capacities."
      },
      {
        "name": "Samsung 4K Smart TV",
        "image": "https://example.com/images/samsung_tv.jpg",
        "description": "This Samsung 4K Smart TV features a crystal clear 65-inch display, with rich colors and deep blacks. The TV is equipped with built-in Wi-Fi and support for popular streaming services, such as Netflix and Hulu. The TV also features voice control for easy operation."
      },
      {
        "name": "Bose QuietComfort Earbuds",
        "image": "https://example.com/images/bose_earbuds.jpg",
        "description": "These wireless earbuds from Bose feature noise cancellation technology and a comfortable, secure fit. The earbuds provide up to 6 hours of battery life and come with a charging case for on-the-go charging."
      },
      {
        "name": "Amazon Echo Dot (4th Gen)",
        "image": "https://example.com/images/echo_dot.jpg",
        "description": "The Amazon Echo Dot is a compact smart speaker with Alexa built-in. The speaker delivers clear, balanced sound, and can be controlled with your voice, the Alexa app, or physical buttons."
      },
      {
        "name": "GoPro HERO10 Black",
        "image": "https://example.com/images/gopro_hero10.jpg",
        "description": "The GoPro HERO10 Black is a powerful action camera with 5.3K video and 23MP photos. The camera features HyperSmooth 4.0 video stabilization and can record up to 240 frames per second for slow-motion footage."
      },
      {
        "name": "DJI Mavic Air 2S",
        "image": "https://example.com/images/dji_mavic_air2s.jpg",
        "description": "The DJI Mavic Air 2S is a compact drone with a 1-inch CMOS sensor and 5.4K video. The drone can fly for up to 31 minutes and features obstacle avoidance sensors for safe flying."
      },
      {
        "name": "Samsung Galaxy Watch4 Classic",
        "image": "https://example.com/images/samsung_watch4.jpg",
        "description": "The Samsung Galaxy Watch4 Classic is a stylish smartwatch with a rotating bezel and a range of health tracking features. The watch can track your sleep, heart rate, and stress levels, and is compatible with a range of Android apps."
      },
      {
        "name": "Apple iPad Pro (5th Gen)",
        "image": "https://example.com/images/ipad_pro.jpg",
        "description": "The Apple iPad Pro (5th Gen) is a powerful tablet with a Liquid Retina XDR display and the A14 Bionic chip. The tablet supports the Apple Pencil and Magic Keyboard, and features 5G connectivity for fast internet speeds."
      },
      {
        "name": "Sony Alpha 7 III",
        "image": "https://example.com/images/sony_alpha7.jpg",
        "description": "The Sony Alpha 7 III is a full-frame mirrorless camera with a 24.2MP sensor and 4K video. The camera features 5-axis image stabilization and a fast autofocus system for capturing stunning photos and videos."
      },
      {
        "name": "LG CX Series 4K OLED TV",
        "image": "https://example.com/images/lg_tv.jpg",
        "description": "This LG 4K OLED TV features a stunning 65-inch display with rich, vibrant colors. The TV supports HDR and Dolby Vision for an immersive viewing experience, and features LG's WebOS platform for easy access to your favorite streaming services."
      },
      {
        "name": "Samsung Galaxy S21 Ultra 5G",
        "image": "https://example.com/images/samsung_s21ultra.jpg",
        "description": "The Samsung Galaxy S21 Ultra 5G is a powerful smartphone with a 6.8-inch AMOLED display and 5G connectivity. The phone features a quad camera setup with up to 100x zoom, and is powered by the Exynos 2100 or Snapdragon 888 processor depending on the region."
      },
      {
        "name": "Microsoft Surface Pro 8",
        "image": "https://example.com/images/surface_pro8.jpg",
        "description": "The Microsoft Surface Pro 8 is a versatile tablet/laptop hybrid with a 13-inch PixelSense display and a range of connectivity options. The device is powered by the 11th Gen Intel Core processor, and supports the Surface Pen and other accessories."
      },
      {
        "name": "Sony PlayStation 5",
        "image": "https://example.com/images/ps5.jpg",
        "description": "The Sony PlayStation 5 is a next-gen gaming console with lightning-fast load times and stunning graphics. The console features a custom AMD Zen 2 processor and RDNA 2 graphics, and supports a range of popular games and streaming services."
      },
      {
        "name": "Bose SoundLink Revolve+ Bluetooth Speaker",
        "image": "https://example.com/images/bose_speaker.jpg",
        "description": "The Bose SoundLink Revolve+ is a portable Bluetooth speaker with 360-degree sound and up to 16 hours of battery life. The speaker is water-resistant and features voice prompts for easy operation."
      },
      {
        "name": "Apple MacBook Pro (2021)",
        "image": "https://example.com/images/macbook_pro.jpg",
        "description": "The Apple MacBook Pro (2021) is a powerful laptop with the M1 Pro or M1 Max chip and up to 10-core CPU. The laptop features a stunning 16-inch Retina display with True Tone technology, and up to 32GB of unified memory for seamless multitasking."
      },
      {
        "name": "Canon EOS R6",
        "image": "https://example.com/images/canon_eosr6.jpg",
        "description": "The Canon EOS R6 is a full-frame mirrorless camera with a 20.1MP CMOS sensor and 4K video. The camera features in-body image stabilization and dual pixel autofocus, and is compatible with a range of Canon RF lenses."
      },
      {
        "name": "LG Gram 17",
        "image": "https://example.com/images/lg_gram17.jpg",
        "description": "The LG Gram 17 is an ultra-lightweight laptop with a 17-inch WQXGA display and up to 19.5 hours of battery life. The laptop features the 11th Gen Intel Core processor and Thunderbolt 4 connectivity, and weighs just 2.98 pounds."
      },
      {
        "name": "Fitbit Charge 5",
        "image": "https://example.com/images/fitbit_charge5.jpg",
        "description": "The Fitbit Charge 5 is a fitness tracker with a range of health and wellness features, including EDA stress management and skin temperature tracking. The tracker is water-resistant and features up to 7 days of battery life."
      },
      {
        "name": "Samsung QN90A Neo QLED TV",
        "image": "https://example.com/images/samsung_qn90a.jpg",
        "description": "The Samsung QN90A is a top-of-the-line Neo QLED TV with a 4K resolution and 120Hz refresh rate. The TV features quantum dot technology for vibrant colors, and is powered by the Quantum Processor 4K for seamless upscaling and optimization of content."
      },
      {
        "name": "Dell XPS 13 (2022)",
        "image": "https://example.com/images/dell_xps13.jpg",
        "description": "The Dell XPS 13 (2022) is a slim and stylish laptop with the 11th Gen Intel Core processor and up to 32GB of RAM. The laptop features a 13.4-inch 4K display with Dolby Vision, and weighs just 2.64 pounds."
      },
      {
        "name": "Apple Watch Series 7",
        "image": "https://example.com/images/apple_watch7.jpg",
        "description": "The Apple Watch Series 7 is a smartwatch with a range of health and fitness features, including blood oxygen and ECG monitoring. The watch features an always-on Retina display and up to 18 hours of battery life, and is compatible with a range of bands and accessories."
      },
      {
        "name": "Sony A7S III",
        "image": "https://example.com/images/sony_a7s3.jpg",
        "description": "The Sony A7S III is a full-frame mirrorless camera with a 12.1MP sensor and 4K/120p video. The camera features advanced autofocus and image stabilization, and is compatible with a range of Sony E-mount lenses."
      },
      {
        "name": "Microsoft Xbox Series X",
        "image": "https://example.com/images/xbox_seriesx.jpg",
        "description": "The Microsoft Xbox Series X is a next-gen gaming console with 4K gaming and up to 120fps. The console features a custom AMD Zen 2 processor and RDNA 2 graphics, and supports a range of popular games and streaming services."
      }
    ]
  }
  